УчетВУправляющихДляГит1/src/DataProcessors/ПомощникЗаполнения3НДФЛ/ПомощникЗаполнения3НДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗаполнения3НДФЛ</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогКУплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвансовыеПлатежиИП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СформироватьДекларацию4НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемаяСуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки4НДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоходыВычеты</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВычетыФизическихЛиц</types>
        <types>EnumRef.ИсточникиДоходовФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Информация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВычета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/Enums/ИсточникиДоходовФизическихЛиц/ИсточникиДоходовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиДоходовФизическихЛиц</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДоходЗаПределамиРФ</name>
  </enumValues>
  <enumValues>
    <name>ИнойДоходОтИсточникаРФ</name>
  </enumValues>
  <enumValues>
    <name>ОперацииСЦеннымиБумагами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>Подарок</name>
  </enumValues>
  <enumValues>
    <name>ПредпринимательскаяДеятельность</name>
  </enumValues>
  <enumValues>
    <name>ПродажаИмущества</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНедвижимости</name>
  </enumValues>
  <enumValues>
    <name>СдачаИмуществаВАренду</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/DataProcessors/ПомощникЗаполнения3НДФЛ/Forms/ПредпринимательскаяДеятельность/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, Период, АвансовыеПлатежи, УплаченныйТорговыйСбор");
	
	Если Параметры.Свойство("СтруктураДоходовВычетов") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураДоходовВычетов);
	Иначе
		СпособЗаполнения = "Вручную";
	КонецЕсли;
	
	ПроцентПрофВычета = Отчеты.РегламентированныйОтчет3НДФЛ.ПроцентПрофессиональногоВычета(Параметры.Декларация3НДФЛВыбраннаяФорма);
	УплачиваетсяТорговыйСбор = ТорговыйСбор.УплачиваетсяТорговыйСбор(Организация, КонецГода(Период));
	
	УстановитьФункциональныеОпцииФормы();
	
	УстановитьПараметрыВыбораВидаДеятельности();
	
	УправлениеФормой();
	
	УстановитьКлючСохраненияПоложенияОкна(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Модифицированность ИЛИ ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения,
		НСтр("ru='Данные были изменены. Сохранить изменения?'"),
		РежимДиалогаВопрос.ДаНетОтмена,
		,
		КодВозвратаДиалога.Да);
	
	Отказ = Истина;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СпособЗаполнения = "Вручную" Или Не УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(Организация, Период) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидДеятельности");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СохранитьРезультатИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодОКВЭДПриИзменении(Элемент)
	
	// Исправление возможной опечатки в разделителе
	КодОКВЭД = СтрЗаменить(СокрЛП(КодОКВЭД), ",", ".");
	
	НаименованиеОКВЭД = ОрганизацииФормыДляОтчетностиВызовСервера.НаименованиеПоКлассификатору("ОКВЭД2", КодОКВЭД);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОрганизацииФормыДляОтчетностиКлиент.ВыбратьКодИзКлассификатора(
		"ОКВЭД2",
		"КодОКВЭД",
		"НаименованиеОКВЭД",
		ЭтотОбъект,
		ЭтотОбъект,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеятельностиПриИзменении(Элемент)
	
	ВидДеятельностиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
	
	СпособЗаполненияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоходаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРасходыВручнуюПриИзменении(Элемент)
	РассчитатьИтогоРасходов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРасходыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияВручнуюПриИзменении(Элемент)
	РассчитатьИтогоРасходов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаВручнуюПриИзменении(Элемент)
	РассчитатьИтогоРасходов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеРасходыВручнуюПриИзменении(Элемент)
	РассчитатьИтогоРасходов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеРасходыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ИтогоПодтвержденныхРасходовНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РасшифроватьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура АвансовыеПлатежиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода", НачалоГода(Период));
	ПараметрыФормы.Вставить("КонецПериода",  КонецГода(Период));
	ПараметрыФормы.Вставить("Организация",   Организация);
	
	ПредставлениеПериода = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		НачалоГода(Период), КонецГода(Период), Истина);
	ПараметрыФормы.Вставить("Заголовок",     СтрШаблон(НСтр("ru = 'Авансовые платежи по НДФЛ за %1'"), ПредставлениеПериода));
	
	ОткрытьФорму("Обработка.ПомощникЗаполнения3НДФЛ.Форма.РасшифровкаАвансовыхПлатежей", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УплаченныйТорговыйСборНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода", НачалоГода(Период));
	ПараметрыФормы.Вставить("КонецПериода",  КонецГода(Период));
	ПараметрыФормы.Вставить("Организация",   Организация);
	
	ПредставлениеПериода = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		НачалоГода(Период), КонецГода(Период), Истина);
	ПараметрыФормы.Вставить("Заголовок",     СтрШаблон(НСтр("ru = 'Торговый сбор, уплаченный в %1'"), ПредставлениеПериода));
	
	ОткрытьФорму("Обработка.ПомощникЗаполнения3НДФЛ.Форма.РасшифровкаУплаченногоТорговогоСбора", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если СпособЗаполнения = "ПоДаннымУчета" Тогда
		Элементы.ГруппаСуммыПоДаннымУчета.Видимость = Истина;
		Элементы.ГруппаСуммыВручную.Видимость = Ложь;
		Элементы.ВидДеятельности.Видимость = Истина;
	Иначе
		Элементы.ГруппаСуммыПоДаннымУчета.Видимость = Ложь;
		Элементы.ГруппаСуммыВручную.Видимость = Истина;
		Элементы.ВидДеятельности.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.УплаченныйТорговыйСбор.Видимость = УплачиваетсяТорговыйСбор;
	Элементы.УплаченныйТорговыйСборВручную.Видимость = УплачиваетсяТорговыйСбор;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКлючСохраненияПоложенияОкна(Форма)
	
	ШаблонКлюча = "[СпособЗаполнения][ТорговыйСбор]";
	СтруктураКлюча = Новый Структура("СпособЗаполнения, ТорговыйСбор");
	СтруктураКлюча.СпособЗаполнения = Форма.СпособЗаполнения;
	СтруктураКлюча.ТорговыйСбор = ?(Форма.УплачиваетсяТорговыйСбор, "УплачиваетсяТорговыйСбор", "");
	
	Форма.КлючСохраненияПоложенияОкна = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонКлюча, СтруктураКлюча);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрОрганизацияФункциональныхОпцийФормы(ЭтотОбъект, Организация, Период);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораВидаДеятельности()
	
	ХарактерыДеятельностиОСН = УчетДоходовИРасходовПредпринимателя.ХарактерыДеятельностиОСН();
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ХарактерДеятельности", ХарактерыДеятельностиОСН));
	
	Элементы.ВидДеятельности.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		// Если нажали кнопку "Отмена", то ничего не делаем.
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатИЗакрыть();
	Иначе
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультатИЗакрыть()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Вид", ПредопределенноеЗначение("Перечисление.ИсточникиДоходовФизическихЛиц.ПредпринимательскаяДеятельность"));
	СтруктураОтвета.Вставить("Информация",                  Строка(НаименованиеОКВЭД));
	СтруктураОтвета.Вставить("СуммаДохода",                 СуммаДохода);
	СтруктураОтвета.Вставить("СуммаВычета",                 ИтогоПодтвержденныхРасходов);
	
	СтруктураОтвета.Вставить("КодОКВЭД",                    КодОКВЭД);
	СтруктураОтвета.Вставить("НаименованиеОКВЭД",           НаименованиеОКВЭД);
	СтруктураОтвета.Вставить("ВидДеятельности",             ВидДеятельности);
	СтруктураОтвета.Вставить("МатериальныеРасходы",         МатериальныеРасходы);
	СтруктураОтвета.Вставить("Амортизация",                 Амортизация);
	СтруктураОтвета.Вставить("Зарплата",                    Зарплата);
	
	// Считаем что вся оплата труда по трудовым договорам.
	СтруктураОтвета.Вставить("ВыплатыПоТрудовымДоговорам",  Зарплата);
	
	СтруктураОтвета.Вставить("ПрочиеРасходы",               ПрочиеРасходы);
	СтруктураОтвета.Вставить("ИтогоПодтвержденныхРасходов", ИтогоПодтвержденныхРасходов);
	СтруктураОтвета.Вставить("ИтогоРасходовНоНормативу",    СуммаДохода * ПроцентПрофВычета / 100);
	
	СтруктураОтвета.Вставить("АвансовыеПлатежи",            АвансовыеПлатежи);
	СтруктураОтвета.Вставить("УплаченныйТорговыйСбор",      УплаченныйТорговыйСбор);
	
	СтруктураОтвета.Вставить("СпособЗаполнения",            СпособЗаполнения);
	
	Модифицированность = Ложь;
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура СпособЗаполненияПриИзмененииНаСервере()
	
	Если Не УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(Организация, Период) Тогда
		ВидДеятельности = УчетнаяПолитика.ОсновнойВидДеятельности(Организация, Период);
		ЗаполнитьОКВЭД();
	КонецЕсли;
	
	Если СпособЗаполнения = "ПоДаннымУчета" Тогда
		ОбновитьПоказателиНаСервере();
	КонецЕсли;
	
	УправлениеФормой();
	
	УстановитьКлючСохраненияПоложенияОкна(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВидДеятельностиПриИзмененииНаСервере()
	
	ЗаполнитьОКВЭД();
	
	Если СпособЗаполнения = "ПоДаннымУчета" Тогда
		ОбновитьПоказателиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОКВЭД()
	
	КодОКВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДеятельности, "КодОКВЭД");
	
	Если Не ЗначениеЗаполнено(КодОКВЭД) И ВидДеятельности = УчетнаяПолитика.ОсновнойВидДеятельности(Организация, Период) Тогда
		КодОКВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КодОКВЭД2");
	КонецЕсли;
	
	НаименованиеОКВЭД = ОрганизацииФормыДляОтчетностиВызовСервера.НаименованиеПоКлассификатору("ОКВЭД2", КодОКВЭД);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогоРасходов(Форма)
	
	Форма.ИтогоПодтвержденныхРасходов = Форма.МатериальныеРасходы
		+ Форма.Амортизация
		+ Форма.Зарплата
		+ Форма.ПрочиеРасходы;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьСуммы()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимРасшифровки", Истина);
	СтруктураПараметров.Вставить("Организация",      Организация);
	СтруктураПараметров.Вставить("НачалоПериода",    НачалоГода(Период));
	СтруктураПараметров.Вставить("КонецПериода",     КонецГода(Период));
	
	ОткрытьФорму("Отчет.КнигаУчетаДоходовИРасходовПредпринимателя.Форма", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиНаСервере()
	
	Показатели = Новый Структура;
	Показатели.Вставить("СуммаДохода", 0);
	Показатели.Вставить("МатериальныеРасходы", 0);
	Показатели.Вставить("Амортизация", 0);
	Показатели.Вставить("Зарплата", 0);
	Показатели.Вставить("ПрочиеРасходы", 0);
	
	Если ЗначениеЗаполнено(ВидДеятельности) Тогда
		ДоходыРасходыИП = Обработки.ПомощникЗаполнения3НДФЛ.ТаблицаДоходовОтПредпринимательскойДеятельности(
			Организация, НачалоГода(Период), КонецГода(Период));
		
		ДоходыПоВидуДеятельности = ДоходыРасходыИП.НайтиСтроки(Новый Структура("ВидДеятельности", ВидДеятельности));
		
		Для Каждого СтрокаДоходов Из ДоходыПоВидуДеятельности Цикл
			
			Показатели.СуммаДохода = Показатели.СуммаДохода + СтрокаДоходов.ИтогоДоходов;
			Показатели.МатериальныеРасходы = Показатели.МатериальныеРасходы + СтрокаДоходов.МатериальныеРасходы;
			Показатели.Амортизация = Показатели.Амортизация + СтрокаДоходов.Амортизация;
			Показатели.Зарплата = Показатели.Зарплата + СтрокаДоходов.РасходыНаОплатуТруда;
			Показатели.ПрочиеРасходы = Показатели.ПрочиеРасходы + СтрокаДоходов.ПрочиеРасходы;
			
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Показатели);
	
	РассчитатьИтогоРасходов(ЭтотОбъект);
	
	АвансовыеПлатежи = Обработки.ПомощникЗаполнения3НДФЛ.АвансовыеПлатежиПоНДФЛЗаПериод(
		Организация, НачалоГода(Период), КонецГода(Период));
	
	Если ТорговыйСбор.УплачиваетсяТорговыйСбор(Организация, КонецГода(Период)) Тогда
		УплаченныйТорговыйСбор = Обработки.ПомощникЗаполнения3НДФЛ.ТорговыйСборУплаченныйЗаПериод(
			Организация, НачалоГода(Период), КонецГода(Период));
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
